module.exports = {
  TOKEN: "8685523042:AAEz5WOct99oA84valDTIbxAgdJ-EDn4gSQ",

  ADMIN_IDS: [1007247805],

  TARGET_CHAT_ID: -1001234567890,

  REQUIRED_CHANNEL_ID: -1003404332093,
  REQUIRED_CHANNEL_LINK: "https://t.me/+vNqkhCIZT1gyZjZi",

  AUTOPOST_INTERVAL: 2000,

  AUTOPOST_MESSAGES: [
    "💡 <b>Напоминание</b>\nПоддерживайте активность в чате и следите за обновлениями.",
    "📢 <b>Автопостинг</b>\nПеред участием в чате убедитесь, что вы подписаны на обязательный канал.",
    "⚡ <b>Важно</b>\nНесоблюдение правил чата может привести к муту или бану.",
    "💡 <b>Напоминание</b>\nПоддерживайте активность в чате и следите за обновлениями.",
    "🔔 <b>Напоминание</b>\nПодписка на канал обязательна для нахождения в этом чате."
  ]
};